{
  "estagiario": {
    "nome_completo": "Paolla Cardoso Queiroz",
    "nusp": "14601646",
    "curso": "Engenharia da Computação",
    "telefone": "(62) 99924-2911",
    "email": "paolla@usp.br"
  },
  "supervisor": {
    "nome_completo": "Carlos Silva Ramos Poita",
    "telefone": null,
    "email": "Poita.Carlos@btgpactual.com"
  },
  "estagio": {
    "razao_social_empresa": "Banco BTG Pactual S.A. -SP",
    "cnpj": "30.306.294/0002-26",
    "periodo_inicio": "05 de Maio de 2025",
    "periodo_fim": "29 de Agosto de 2025",
    "carga_horaria_semanal": "30 horas semanais",
    "carga_horaria_total": "450 (no dia 15 de agosto)"
  },
  "sobre_empresa": "O BTG Pactual é uma instituição financeira brasileira fundada em 1983, inicialmente como Pactual, uma pequena corretora de títulos sediada no Rio de Janeiro. A trajetória da instituição ganhou um novo capítulo em 2009, quando se transformou em BTG Pactual após a aquisição do Banco UBS Pactual pelo grupo liderado por André Esteves, que anteriormente havia vendido o Pactual ao UBS em 2006.\n\nO nome BTG (Banking and Trading Group) surgiu como uma boutique de investimentos criada por André Esteves após sua saída do UBS. Com a recompra e fusão com o Pactual, nasceu o que hoje é considerado o maior banco de investimentos da América Latina.\n\nAo longo dos anos, o BTG Pactual consolidou-se no mercado financeiro brasileiro e expandiu suas operações para outros países da América Latina, Europa, Estados Unidos e Ásia. A instituição se destaca por sua capacidade de inovação e adaptação às mudanças do mercado, mantendo-se na vanguarda do setor financeiro.",
  "atividades_realizadas": [
    {
      "numero": "1",
      "descricao": "Estudar a AWS fazendo o Workshop AWS 101",
      "tarefas_realizadas": "Durante o Workshop AWS 101, configurei uma VPC com sub-redes públicas e privadas, lancei instâncias EC2 com Linux, implementei um Load Balancer para distribuir o tráfego e integrei o serviço S3 para armazenar arquivos estáticos do site.",
      "papel_exercido": "Realizei as atividades sozinha, seguindo o material disponibilizado. Contudo, o meu gestor me ajudava nos momentos que eu não conseguia resolver problemas por conta própria e assim consegui entregar um ambiente AWS funcional ao final do workshop.",
      "duracao": "1 semana",
      "comentarios": "O workshop foi muito bem estruturado e me ajudou a entender como funciona a AWS na prática. Foi meu primeiro contato real com computação em nuvem e pude ver como os conceitos teóricos se aplicam no dia a dia. Entendi melhor por que o BTG utiliza a AWS para vários projetos de tecnologia, inclusive na área de Digital Assets.",
      "aprendizados": "• Aprendi os conceitos básicos de infraestrutura em nuvem\n• Consegui criar e configurar redes virtuais na AWS\n• Desenvolvi habilidade para criar e gerenciar servidores virtuais (EC2)\n• Entendi como funciona o Load Balancing (ALB)\n• Aprendi práticas básicas de segurança para aplicações web (IAM)\n• Conheci o S3 para armazenamento de arquivos\n• Tive contato com a interface de linha de comando da AWS\n• Entendi como a infraestrutura como código funciona na prática"
    },
    {
      "numero": "2",
      "descricao": "Construção de um sistema que coleta, processa e produz relatórios de FICC com o uso de inteligência artificial",
      "tarefas_realizadas": "• Desenvolvi quatro funções Lambda interconectadas com diferentes responsabilidades no fluxo de processamento\n• Implementei algoritmos de limpeza de texto para remover disclaimers legais e conteúdo irrelevante de emails financeiros\n• Construí um sistema de detecção de duplicatas utilizando funções hash criptográficas (Blake2)\n• Integrei modelos de IA do Amazon Bedrock (Claude) para processamento natural de linguagem e extração de insights financeiros\n• Implementei um mecanismo de busca semântica utilizando a biblioteca FAISS para recuperação eficiente de contexto relevante\n• Configurei e otimizei uma imagem Docker para a função Lambda responsável pela execução do FAISS, garantindo a correta instalação de suas dependências nativas e maximizando o desempenho da busca vetorial\n• Desenvolvi lógica para segmentação inteligente de textos financeiros em chunks otimizados para embedding\n• Criei um sistema de distribuição multicanal dos relatórios via Microsoft Teams e APIs internas\n• Implementei mecanismos de programação baseados em horários para sincronização com mercados financeiros globais",
      "papel_exercido": "Atuei como desenvolvedor de software fullstack com foco em inteligência artificial aplicada ao setor financeiro, sendo responsável pela implementação de componentes críticos da arquitetura serverless em AWS. Participei ativamente de todas as etapas do ciclo de desenvolvimento, desde a engenharia de dados (coleta e limpeza de emails financeiros) até a implementação de soluções avançadas de IA para processamento de linguagem natural e busca semântica. Tive papel fundamental na configuração e otimização da infraestrutura em nuvem, especialmente na integração de contêineres Docker com AWS Lambda para execução eficiente da biblioteca FAISS, contribuindo diretamente para a automação de processos críticos do departamento de FICC.",
      "duracao": "2 meses e 2 semanas",
      "comentarios": "Este foi um projeto muito complexo, desenvolvido exclusivamente por mim e meu chefe, o que me proporcionou uma experiência de aprendizado intensiva. Comecei sabendo apenas o básico de AWS e, ao longo do desenvolvimento, meu gestor atuou como mentor dedicado, me guiando através de cada tecnologia nova que precisávamos implementar.",
      "aprendizados": "• Adquiri conhecimento profundo sobre arquiteturas serverless e comunicação síncrona entre serviços AWS\n• Desenvolvi competências em processamento de linguagem natural aplicado ao domínio financeiro\n• Aprimorei minhas habilidades em técnicas avançadas de busca semântica e construção de índices vetoriais\n• Compreendi melhor os desafios específicos do processamento de dados de FICC, incluindo jargões e conceitos financeiros\n• Aprofundei conhecimentos em prompt engineering para obter resultados consistentes de modelos de IA generativa\n• Aprendi a otimizar custos em sistemas serverless com alto volume de processamento\n• Desenvolvi habilidades em análise de performance e debugging em ambientes distribuídos\n• Ganhei experiência prática na implementação de sistemas de IA responsivos às dinâmicas temporais dos mercados financeiros globais"
    },
    {
      "numero": "3",
      "descricao": "Chatbot com AI Agents – Criptoativos",
      "tarefas_realizadas": "• Desenvolvi lógica para sincronização diária de conteúdos de múltiplos canais (Twitter, WhatsApp, macrofeed, cartas FOM, etc.)\n• Criei um sistema de particionamento temporal para garantir que apenas os dados mais recentes fossem consultados\n• Implementei gerenciamento de ciclo de vida dos datasources, com exclusão automática de dados desatualizados\n• Construí lógica de verificação e controle de jobs de ingestão para evitar conflitos e sobrecarga\n• Desenvolvi integração entre Lambda e Amazon S3 para listar e verificar existência de arquivos JSON\n• Configurei uma arquitetura de agentes hierárquicos (Supervisor e Colaboradores) para consultas especializadas\n• Implementei mecanismos de paginação para lidar com grandes volumes de dados",
      "papel_exercido": "Atuei como desenvolvedora de soluções de IA, focando na implementação do backend para ingestão e atualização automática de dados confidenciais sobre criptoativos. Fui responsável pela arquitetura da solução baseada em Lambda AWS e Amazon Bedrock para criar um fluxo de atualização de conhecimento que mantivesse o chatbot sempre com as informações mais recentes disponíveis para consulta.",
      "duracao": "1 semana",
      "comentarios": "A implementação de um sistema baseado em Bedrock Agents exigiu conhecimento profundo sobre como gerenciar Knowledge Bases e manter informações atualizadas de forma eficiente.",
      "aprendizados": "• Dominei a implementação e gerenciamento de Amazon Bedrock Knowledge Bases e Agents\n• Desenvolvi profundo conhecimento sobre sistemas de particionamento temporal em armazenamento de dados\n• Aprendi a trabalhar com concorrência e sincronização em ambientes serverless\n• Adquiri experiência em estratégias de paginação para processamento eficiente de grandes volumes de dados\n• Implementei padrões de verificação e espera (polling) para lidar com processos assíncronos de longa duração\n• Compreendi arquiteturas de agentes hierárquicos para processamento especializado de consultas em linguagem natural\n• Desenvolvi habilidades avançadas de debugging em ambientes distribuídos com logs estruturados\n• Aprendi a lidar com transições de estado e gerenciamento de ciclo de vida de recursos na AWS\n• Ganhei experiência em arquitetar soluções respeitando limites de APIs e implementando mecanismos de retry\n• Aprofundei conhecimentos em controle de fluxo em sistemas assíncronos e tratamento robusto de exceções\n• Adquiri familiaridade com o domínio de criptoativos e suas particularidades informacionais\n• Compreendi a importância de sistemas de atualização automática de conhecimento para manter agentes de IA atualizados com informações recentes"
    },
    {
      "numero": "4",
      "descricao": "Chatbot AI Agents – Relatórios FICC",
      "tarefas_realizadas": "• Projetei e implementei uma arquitetura de agentes de IA acessada via Microsoft Teams\n• Desenvolvi um sistema de Supervisor Agent que coordena sete agentes especialistas regionais (Brasil, LATAM, Asia, UK, US, EUR, FX/RATES)\n• Configurei cada agente especialista para trabalhar com até três sistemas de pensamento (think nodes) e APIs especializadas\n• Implementei a integração completa com a plataforma N8N, criando fluxos de automação complexos com mais de 25 nós interconectados\n• Desenvolvi Lambdas dedicados para processar requisições entre Teams, N8N, agentes de IA e buckets S3\n• Criei um sistema com o uso do NOVA-Pro e NOVA-Micro para garantir um melhor pensamento na hora das respostas mesmo em cenários de falha\n• Implementei rotas de API Gateway para expor os serviços de forma segura\n• Construí interfaces HTML responsivas para visualização de relatórios, com integração a agentes especializados\n• Desenvolvi prompts específicos para cada agente regional, otimizando seus conhecimentos em mercados específicos\n• Configurei um sistema de webhooks bidirecionais para comunicação instantânea entre todos os componentes da arquitetura",
      "papel_exercido": "Atuei como desenvolvedora principal na criação de um sistema avançado de chatbot multi-agente para consultas financeiras, implementando toda a arquitetura de IA conversacional sob supervisão. Fui responsável pela integração entre plataformas (Microsoft Teams, Amazon Bedrock, N8N) e pelo desenvolvimento dos componentes de infraestrutura na AWS, incluindo Lambdas e API Gateway. Desempenhei papel fundamental na configuração dos agentes de IA especializados por região, implementando sistemas de pensamento hierárquicos e fluxos de trabalho automatizados complexos.",
      "duracao": "1 mês",
      "comentarios": "Foi um projeto extremamente desafiador que exigiu aprendizado intensivo de tecnologias emergentes como AI Agents e N8N, ambas com documentação limitada devido à sua novidade no mercado. Desenvolver duas arquiteturas paralelas e complementares – uma para acesso via web e outra para Microsoft Teams elevou significativamente a complexidade do projeto.",
      "aprendizados": null
    }
  ],
  "conclusao": "O estágio me proporcionou um crescimento técnico extraordinário em um curto período. Comecei com conhecimentos básicos de programação e, em poucos meses, consegui desenvolver sistemas completos baseados em inteligência artificial para aplicações financeiras reais.\n\nA jornada de aprendizado foi intensamente progressiva. Iniciei com o Workshop AWS 101, onde aprendi fundamentos de computação em nuvem, e rapidamente avancei para implementações cada vez mais complexas. O que mais me impressionou foi como cada projeto construía sobre as habilidades do anterior, permitindo-me aplicar conhecimentos recém-adquiridos enquanto incorporava novas tecnologias.\n\nMeu gestor teve papel fundamental nesse processo, atuando como um verdadeiro mentor técnico. As explicações detalhadas sobre arquiteturas e tecnologias aceleraram significativamente minha curva de aprendizado. Em vez de apenas seguir tutoriais, fui constantemente desafiada a entender os conceitos subjacentes, exercer na prática o que estava aprendendo e o porquê de cada decisão arquitetural.\n\nTrabalhar com dados financeiros reais trouxe um contexto valioso que não seria possível em projetos acadêmicos. Compreender como as informações de FICC e criptoativos são consumidas por profissionais de mercado me ajudou a desenvolver soluções verdadeiramente úteis, não apenas tecnicamente corretas. Ver esses sistemas sendo utilizados por diretores e parceiros do banco foi extremamente gratificante e validou o esforço investido no aprendizado.\n\nA exposição a tecnologias emergentes como MultiAgents do Amazon Bedrock e N8N, mesmo com documentação limitada, me ensinou a ser resiliente e autodidata. Aprendi a navegar pela incerteza técnica, experimentar abordagens diferentes e adaptar soluções conforme necessário.\n\nEste estágio transcendeu minhas expectativas, transformando-me de uma estudante com conhecimentos teóricos em uma profissional capaz de implementar soluções avançadas de IA no setor financeiro. A experiência prática com essas tecnologias de ponta, combinada com a compreensão do contexto de negócios, proporcionou-me uma base sólida para minha futura carreira em tecnologia."
}